app/views/location/index.html.erb

SELECT locations.*, 3958.755864232 * 2 * ASIN(SQRT(POWER(SIN((-13.1636 - locations.latitude) * PI() / 180 / 2), 2) + COS(-13.1636 * PI() / 180) * COS(locations.latitude * PI() / 180) * POWER(SIN((-72.5459 - locations.longitude) * PI() / 180 / 2), 2))) AS distance, CAST(DEGREES(ATAN2( RADIANS(locations.longitude - -72.5459), RADIANS(locations.latitude - -13.1636))) + 360 AS decimal) % 360 AS bearing FROM `locations` WHERE (locations.latitude BETWEEN -13.308331783110848 AND -13.018868216889153 AND locations.longitude BETWEEN -72.69453741281728 AND -72.39726258718272 AND 3958.755864232 * 2 * ASIN(SQRT(POWER(SIN((-13.1636 - locations.latitude) * PI() / 180 / 2), 2) + COS(-13.1636 * PI() / 180) * COS(locations.latitude * PI() / 180) * POWER(SIN((-72.5459 - locations.longitude) * PI() / 180 / 2), 2))) <= 10 AND locations.id != 36) ORDER BY distance ASC
---
			<div class="col-lg-6 location">
				<%= Location.where(:user_id=>current_user.id).last.address %>