app/controllers/article_controller.rb

INSERT INTO `articles` (`created_at`, `desc`, `title`, `updated_at`) VALUES ('2014-02-12 19:51:44', 'wrdffr', 'd3rf', '2014-02-12 19:51:44')
---
  def create
  	@post=Article.new
    @post_user_id=current_user.id
  	@post.title=params[:title]
  	@post.desc=params[:desc]
  	if @post.save