app/controllers/location_controller.rb

SELECT locations.*, 3958.755864232 * 2 * ASIN(SQRT(POWER(SIN((-13.1636 - locations.latitude) * PI() / 180 / 2), 2) + COS(-13.1636 * PI() / 180) * COS(locations.latitude * PI() / 180) * POWER(SIN((-72.5459 - locations.longitude) * PI() / 180 / 2), 2))) AS distance, CAST(DEGREES(ATAN2( RADIANS(locations.longitude - -72.5459), RADIANS(locations.latitude - -13.1636))) + 360 AS decimal) % 360 AS bearing FROM `locations` WHERE (locations.latitude BETWEEN -13.308331783110848 AND -13.018868216889153 AND locations.longitude BETWEEN -72.69453741281728 AND -72.39726258718272 AND 3958.755864232 * 2 * ASIN(SQRT(POWER(SIN((-13.1636 - locations.latitude) * PI() / 180 / 2), 2) + COS(-13.1636 * PI() / 180) * COS(locations.latitude * PI() / 180) * POWER(SIN((-72.5459 - locations.longitude) * PI() / 180 / 2), 2))) <= 10 AND locations.id != 36) ORDER BY distance ASC
SELECT COUNT(*) FROM `locations` WHERE `locations`.`user_id` = 1
---
  def index
  	if current_user
  		@loc=Location.where(:user_id=>current_user.id)
  		count=@loc.count

INSERT INTO `locations` (`address`, `created_at`, `latitude`, `longitude`, `updated_at`, `user_id`) VALUES ('sydney opera house', '2014-02-12 23:56:44', -33.8568704, 151.2152787, '2014-02-12 23:56:44', 1)
---
  def create
  	@post=Location.new
    @post.user_id=current_user.id
  	@post.address=params[:address]
    @post.save